examples/dfLowMachFoam/oneD_freelyPropagation/CH4/cvodeSolver/0/CH2(S)
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object       CH2(S);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar>
4335
(
1.930605989856546e-14
1.921925845067268e-14
1.913269862340828e-14
1.904638009568311e-14
1.896030254640805e-14
1.887446565449397e-14
1.878886909885172e-14
1.870351255839218e-14
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet
    {
        type            zeroGradient;
    }
    wall
    {
        type            empty;
    }
}


// ************************************************************************* //
