examples/dfLowMachFoam/oneD_freelyPropagation/CH4/cvodeSolver/0/H2O
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object       H2O;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar>
4335
(
4.228611809854893e-16
-8.632288411259236e-12
-1.720517407559474e-11
-2.571837248954871e-11
-3.417202201084434e-11
-4.256626099720482e-11
-5.090122780635331e-11
-5.917706079601303e-11
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet
    {
        type            zeroGradient;
    }
    wall
    {
        type            empty;
    }
}


// ************************************************************************* //
